app/views/user_profiles/show.html.erb

<h2>tasks accomplished</h2>
<%= @user_profile.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_profile_id" = ?  [["user_profile_id", 2]]