app/controllers/org_profiles_controller.rb

    def index
      @org_profiles = OrgProfile.all
---
SELECT "org_profiles".* FROM "org_profiles"

    def show
        @org_profile = OrgProfile.find(params[:id])
---
SELECT "org_profiles".* FROM "org_profiles" WHERE "org_profiles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def update
      @org_profile = OrgProfile.find(params[:id])
---
SELECT "org_profiles".* FROM "org_profiles" WHERE "org_profiles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]