app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "org_profiles".* FROM "org_profiles" WHERE "org_profiles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def show
      unless params[:task_id].nil?
        @task_id = params[:task_id]
        puts "task ID is ", :task_id
      else
        @task_id = params[:id]
      end
      @task = Task.find(@task_id)
      @org_profile = OrgProfile.find(params[:org_profile_id])

SELECT "org_profiles".* FROM "org_profiles" WHERE "org_profiles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "tasks" ("blurb", "points", "start_date", "end_date", "created_at", "updated_at", "title", "org_profile_id", "user_profile_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?) RETURNING "id"
---
    def create
        @org_profile = OrgProfile.find(params[:org_profile_id])
        @task = @org_profile.tasks.create(task_params)