app/controllers/user_profiles_controller.rb

  def create
    puts "in create !!!!!!!!!!!!"
    @user_profile = UserProfile.new(user_profile_params)
    puts "profile params are ", user_profile_params
    if @user_profile.save
---
INSERT INTO "user_profiles" ("name", "total_points", "email", "created_at", "updated_at", "tasks_id", "password") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def log_task
    @user_profile = UserProfile.find(params[:user_id])
    @task = Tasks.find(params[:task_id])

    if @user_profile.update(user_profile_params)
---
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "user_profiles" SET "updated_at" = ?, "friends_id" = ? WHERE "user_profiles"."id" = ?  [["updated_at", "2024-08-27 20:53:20.546790"], ["friends_id", 1], ["id", 2]]

  def show
    @user_profile = UserProfile.find(params[:id])
---
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]

  def edit
    @user_profile = UserProfile.find(params[:id])
---
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def update
    @user_profile = UserProfile.find(params[:id])

    if @user_profile.update(user_profile_params)
---
SELECT "user_profiles".* FROM "user_profiles" WHERE "user_profiles"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "user_profiles" SET "email" = ?, "updated_at" = ? WHERE "user_profiles"."id" = ?  [["email", "1@gmail.com"], ["updated_at", "2024-08-22 23:22:39.441697"], ["id", 2]]