app/views/org_profiles/_show.html.erb

<ul>
<% org_profile.tasks.each do |task| %>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."org_profile_id" = ?  [["org_profile_id", 3]]